Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# Find_MultiEncoding_Name
source: Encodings to search
ar: الترميزات المراد البحث فيها
cs: Kódování k prohledání
de: Zu durchsuchende Codierungen
el: Κωδικοποιήσεις για αναζήτηση
es: Codificaciones en las que buscar
fa: رمزگذاری‌ها برای جستجو
fr: Encodages à rechercher
hu: Keresendő kódolások
id: Pengodean yang dicari
it: Codifiche da cercare
ja: 検索する文字コード
ko: 검색할 인코딩
pl: Kodowania do przeszukania
pt: Codificações a pesquisar
ro: Codificări de căutat
th: การเข้ารหัสที่จะค้นหา
tr: Aranacak kodlamalar
uk: Кодування для пошуку
vi: Bảng mã cần tìm
zh_hans: 要搜索的编码
zh_hant: 要搜尋的編碼

# Find_MultiTerm_Name
source: Multiple terms
ar: عبارات متعددة
cs: Více výrazů
de: Mehrere Begriffe
el: Πολλαπλοί όροι
es: Varios términos
fa: چند عبارت
fr: Plusieurs termes
hu: Több kifejezés
id: Beberapa istilah
it: Più termini
ja: 複数語
ko: 여러 검색어
pl: Wiele terminów
pt: Vários termos
ro: Termeni multipli
th: หลายคำ
tr: Birden çok terim
uk: Кілька термінів
vi: Nhiều từ
zh_hans: 多个搜索词
zh_hant: 多個字詞

# Find_PartsMore
source: {0} … ({1} in all)
ar: {0} … ({1} إجمالاً)
cs: {0} … (celkem {1})
de: {0} … ({1} insgesamt)
el: {0} … ({1} συνολικά)
es: {0} … ({1} en total)
fa: {0} … (در مجموع {1})
fr: {0} … ({1} au total)
hu: {0} … (összesen {1})
id: {0} … (total {1})
it: {0} … ({1} in tutto)
ja: {0} … (全 {1} 種類)
ko: {0} …(모두 {1}개)
pl: {0} … (łącznie {1})
pt: {0} … ({1} no total)
ro: {0} … ({1} în total)
th: {0} … (ทั้งหมด {1})
tr: {0} … (toplam {1})
uk: {0} … (усього {1})
vi: {0} … (tổng {1})
zh_hans: {0} …（共 {1} 个）
zh_hant: {0} …（共 {1} 個）

# Find_PositionBase_Address.Content
source: Displayed address
ar: العنوان المعروض
cs: Zobrazená adresa
de: Angezeigte Adresse
el: Εμφανιζόμενη διεύθυνση
es: Dirección mostrada
fa: آدرس نمایش‌داده‌شده
fr: Adresse affichée
hu: Megjelenített cím
id: Alamat yang ditampilkan
it: Indirizzo visualizzato
ja: 表示上のアドレス
ko: 표시된 주소
pl: Wyświetlany adres
pt: Endereço exibido
ro: Adresa afișată
th: ที่อยู่ที่แสดง
tr: Görüntülenen adres
uk: Відображувана адреса
vi: Địa chỉ hiển thị
zh_hans: 显示的地址
zh_hant: 顯示的位址

# Find_PositionBase_Offset.Content
source: Document offset
ar: إزاحة المستند
cs: Posun v dokumentu
de: Dokument-Offset
el: Μετατόπιση εγγράφου
es: Desplazamiento en el documento
fa: آفست سند
fr: Décalage dans le document
hu: Dokumentumbeli eltolás
id: Offset dokumen
it: Offset nel documento
ja: ドキュメントのオフセット
ko: 문서 오프셋
pl: Przesunięcie w dokumencie
pt: Deslocamento no documento
ro: Deplasamentul în document
th: ออฟเซ็ตของเอกสาร
tr: Belge ofseti
uk: Зміщення в документі
vi: Độ lệch tài liệu
zh_hans: 文档偏移量
zh_hant: 文件位移

# Find_PositionBase_Name
source: Base of the position condition
ar: أساس شرط الموضع
cs: Základ podmínky pozice
de: Basis der Positionsbedingung
el: Βάση της συνθήκης θέσης
es: Base de la condición de posición
fa: مبنای شرط موقعیت
fr: Base de la condition de position
hu: A pozíciófeltétel alapja
id: Basis kondisi posisi
it: Base della condizione di posizione
ja: 位置の条件の基準
ko: 위치 조건의 기준
pl: Podstawa warunku pozycji
pt: Base da condição de posição
ro: Baza condiției de poziție
th: ฐานของเงื่อนไขตำแหน่ง
tr: Konum koşulunun tabanı
uk: База умови позиції
vi: Cơ sở của điều kiện vị trí
zh_hans: 位置条件的基准
zh_hant: 位置條件的基準

# Find_PositionInfo
source: Position: mod {0} = {1}
ar: الموضع: mod {0} = {1}
cs: Pozice: mod {0} = {1}
el: Θέση: mod {0} = {1}
es: Posición: mod {0} = {1}
fa: موقعیت: mod {0} = {1}
hu: Pozíció: mod {0} = {1}
id: Posisi: mod {0} = {1}
it: Posizione: mod {0} = {1}
ja: 位置: mod {0} = {1}
ko: 위치: mod {0} = {1}
pl: Pozycja: mod {0} = {1}
pt: Posição: mod {0} = {1}
ro: Poziție: mod {0} = {1}
th: ตำแหน่ง: mod {0} = {1}
tr: Konum: mod {0} = {1}
uk: Позиція: mod {0} = {1}
vi: Vị trí: mod {0} = {1}
zh_hans: 位置：mod {0} = {1}
zh_hant: 位置：mod {0} = {1}

# Find_PositionInfo_Multiple
source: Position: multiples of {0}
ar: الموضع: مضاعفات {0}
cs: Pozice: násobky {0}
de: Position: Vielfache von {0}
el: Θέση: πολλαπλάσια του {0}
es: Posición: múltiplos de {0}
fa: موقعیت: مضرب‌های {0}
fr: Position : multiples de {0}
hu: Pozíció: {0} többszörösei
id: Posisi: kelipatan {0}
it: Posizione: multipli di {0}
ja: 位置: {0} の倍数
ko: 위치: {0}의 배수
pl: Pozycja: wielokrotności {0}
pt: Posição: múltiplos de {0}
ro: Poziție: multipli de {0}
th: ตำแหน่ง: ผลคูณของ {0}
tr: Konum: {0} katları
uk: Позиція: кратна {0}
vi: Vị trí: bội số của {0}
zh_hans: 位置：{0} 的倍数
zh_hant: 位置：{0} 的倍數

# Find_PositionModulus.PlaceholderText
source: x (period)
ar: x (الدورة)
cs: x (perioda)
de: x (Periode)
el: x (περίοδος)
es: x (período)
fa: x (دوره)
fr: x (période)
hu: x (periódus)
id: x (periode)
it: x (periodo)
ja: x (周期)
ko: x(주기)
pl: x (okres)
pt: x (período)
ro: x (perioadă)
th: x (รอบ)
tr: x (periyot)
uk: x (період)
vi: x (chu kỳ)
zh_hans: x（周期）
zh_hant: x（週期）

# Find_PositionRemainder.PlaceholderText
source: y (remainder)
ar: y (الباقي)
cs: y (zbytek)
de: y (Rest)
el: y (υπόλοιπο)
es: y (resto)
fa: y (باقی‌مانده)
fr: y (reste)
hu: y (maradék)
id: y (sisa)
it: y (resto)
ja: y (余り)
ko: y(나머지)
pl: y (reszta)
pt: y (resto)
ro: y (rest)
th: y (เศษ)
tr: y (kalan)
uk: y (остача)
vi: y (số dư)
zh_hans: y（余数）
zh_hant: y（餘數）

# Find_PositionPresetSector.Content
source: Sector start
ar: بداية القطاع
cs: Začátek sektoru
de: Sektoranfang
el: Αρχή τομέα
es: Inicio de sector
fa: آغاز سکتور
fr: Début de secteur
hu: Szektor eleje
id: Awal sektor
it: Inizio settore
ja: セクタの先頭
ko: 섹터 시작
pl: Początek sektora
pt: Início do setor
ro: Început de sector
th: ต้นเซกเตอร์
tr: Sektör başı
uk: Початок сектора
vi: Đầu sector
zh_hans: 扇区开头
zh_hant: 磁區開頭

# Find_Position_Custom.Content
source: Offset mod x = y
ar: الإزاحة mod x = y
cs: Posun mod x = y
el: Μετατόπιση mod x = y
es: Desplazamiento mod x = y
fa: آفست mod x = y
fr: Décalage mod x = y
hu: Eltolás mod x = y
ja: 指定する (オフセット mod x = y)
ko: 오프셋 mod x = y
pl: Przesunięcie mod x = y
pt: Deslocamento mod x = y
ro: Deplasament mod x = y
th: ออฟเซ็ต mod x = y
tr: Ofset mod x = y
uk: Зміщення mod x = y
vi: Độ lệch mod x = y
zh_hans: 偏移量 mod x = y
zh_hant: 位移 mod x = y

# Find_Position_None.Content
source: Any position
ar: أي موضع
cs: Libovolná pozice
de: Beliebige Position
el: Οποιαδήποτε θέση
es: Cualquier posición
fa: هر موقعیتی
fr: N'importe quelle position
hu: Bármely pozíció
id: Posisi mana pun
it: Qualsiasi posizione
ja: 位置の条件なし
ko: 모든 위치
pl: Dowolna pozycja
pt: Qualquer posição
ro: Orice poziție
th: ตำแหน่งใดก็ได้
tr: Herhangi bir konum
uk: Будь-яка позиція
vi: Mọi vị trí
zh_hans: 任意位置
zh_hant: 任何位置

# Find_Position_Name
source: Position condition
ar: شرط الموضع
cs: Podmínka pozice
de: Positionsbedingung
el: Συνθήκη θέσης
es: Condición de posición
fa: شرط موقعیت
fr: Condition de position
hu: Pozíciófeltétel
id: Kondisi posisi
it: Condizione di posizione
ja: 位置の条件
ko: 위치 조건
pl: Warunek pozycji
pt: Condição de posição
ro: Condiție de poziție
th: เงื่อนไขตำแหน่ง
tr: Konum koşulu
uk: Умова позиції
vi: Điều kiện vị trí
zh_hans: 位置条件
zh_hant: 位置條件

# Find_Query_Bits
source: Bit pattern (e.g. 1xx0 0001)
ar: نمط البتات (مثل 1xx0 0001)
cs: Bitový vzor (např. 1xx0 0001)
de: Bitmuster (z. B. 1xx0 0001)
el: Μοτίβο bit (π.χ. 1xx0 0001)
es: Patrón de bits (p. ej. 1xx0 0001)
fa: الگوی بیتی (مثلاً 1xx0 0001)
fr: Motif de bits (par ex. 1xx0 0001)
hu: Bitminta (pl. 1xx0 0001)
id: Pola bit (mis. 1xx0 0001)
it: Modello di bit (ad es. 1xx0 0001)
ja: ビットパターン (例: 1xx0 0001)
ko: 비트 패턴(예: 1xx0 0001)
pl: Wzorzec bitowy (np. 1xx0 0001)
pt: Padrão de bits (por exemplo, 1xx0 0001)
ro: Model de biți (de ex. 1xx0 0001)
th: รูปแบบบิต (เช่น 1xx0 0001)
tr: Bit deseni (ör. 1xx0 0001)
uk: Бітовий шаблон (наприклад, 1xx0 0001)
vi: Mẫu bit (ví dụ: 1xx0 0001)
zh_hans: 位模式（例如 1xx0 0001）
zh_hant: 位元模式（例如 1xx0 0001）

# Find_Query_Regex
source: Regular expression
ar: تعبير عادي
cs: Regulární výraz
de: Regulärer Ausdruck
el: Κανονική έκφραση
es: Expresión regular
fa: عبارت باقاعده
fr: Expression régulière
hu: Reguláris kifejezés
id: Ekspresi reguler
it: Espressione regolare
ja: 正規表現
ko: 정규식
pl: Wyrażenie regularne
pt: Expressão regular
ro: Expresie regulată
th: นิพจน์ทั่วไป
tr: Normal ifade
uk: Регулярний вираз
vi: Biểu thức chính quy
zh_hans: 正则表达式
zh_hant: 規則運算式

# Find_Query_Repeat
source: Repeated pattern
ar: نمط متكرر
cs: Opakovaný vzor
de: Wiederholtes Muster
el: Επαναλαμβανόμενο μοτίβο
es: Patrón repetido
fa: الگوی تکراری
fr: Motif répété
hu: Ismétlődő minta
id: Pola berulang
it: Modello ripetuto
ja: 繰り返しのパターン
ko: 반복 패턴
pl: Powtarzany wzorzec
pt: Padrão repetido
ro: Model repetat
th: รูปแบบที่ทำซ้ำ
tr: Yinelenen desen
uk: Повторюваний шаблон
vi: Mẫu lặp lại
zh_hans: 重复的模式
zh_hant: 重複的模式

# Find_Query_Name
source: Search for
ar: البحث عن
cs: Hledat
de: Suchen nach
el: Αναζήτηση για
es: Buscar
fa: جستجوی
fr: Rechercher
hu: Keresett érték
id: Cari
it: Cerca
ja: 検索する値
ko: 찾을 내용
pl: Szukaj
pt: Pesquisar
ro: Căutați
th: ค้นหา
tr: Aranacak
uk: Що шукати
vi: Tìm
zh_hans: 搜索内容
zh_hant: 搜尋目標

# Find_RangeExclude.Content
source: Exclude the range
ar: استبعاد النطاق
cs: Vyloučit rozsah
de: Bereich ausschließen
el: Εξαίρεση του εύρους
es: Excluir el rango
fa: استثنا کردن محدوده
fr: Exclure la plage
hu: Tartomány kizárása
id: Kecualikan rentang
it: Escludi l'intervallo
ja: 除外
ko: 범위 제외
pl: Wyklucz zakres
pt: Excluir o intervalo
ro: Excludere interval
th: ไม่รวมช่วงนี้
tr: Aralığı dışla
uk: Виключити діапазон
vi: Loại trừ phạm vi
zh_hans: 排除该范围
zh_hant: 排除範圍

# Find_RangeType
source: {0} bit {1}
ar: {0} بت {1}
cs: {0} bitů {1}
es: {0} bits {1}
fa: {0} بیتی {1}
fr: {0} bits {1}
hu: {0} bites {1}
ko: {0}비트 {1}
pl: {0}-bitowa {1}
pt: {0} bits {1}
ro: {0} biți {1}
th: {0} บิต {1}
uk: {0} біт {1}
zh_hans: {0} 位{1}
zh_hant: {0} 位元 {1}

# Find_Sign_Signed_Short
source: signed
ar: بإشارة
cs: se znaménkem
de: mit Vorzeichen
el: με πρόσημο
es: con signo
fa: علامت‌دار
fr: signé
hu: előjeles
id: bertanda
it: con segno
ja: 符号あり
ko: 부호 있음
pl: ze znakiem
pt: com sinal
ro: cu semn
th: มีเครื่องหมาย
tr: işaretli
uk: зі знаком
vi: có dấu
zh_hans: 有符号
zh_hant: 帶正負號

# Find_Sign_Unsigned_Short
source: unsigned
ar: بدون إشارة
cs: bez znaménka
de: ohne Vorzeichen
el: χωρίς πρόσημο
es: sin signo
fa: بدون علامت
fr: non signé
hu: előjel nélküli
id: tak bertanda
it: senza segno
ja: 符号なし
ko: 부호 없음
pl: bez znaku
pt: sem sinal
ro: fără semn
th: ไม่มีเครื่องหมาย
tr: işaretsiz
uk: без знака
vi: không dấu
zh_hans: 无符号
zh_hant: 不帶正負號

# Find_Sign_Either_Short
source: signed or unsigned
ar: بإشارة أو بدون إشارة
cs: se znaménkem i bez
de: mit oder ohne Vorzeichen
el: με ή χωρίς πρόσημο
es: con o sin signo
fa: علامت‌دار یا بدون علامت
fr: signé ou non signé
hu: előjeles vagy előjel nélküli
id: bertanda atau tak bertanda
it: con o senza segno
ja: 符号あり・なし
ko: 부호 있음 또는 없음
pl: ze znakiem lub bez znaku
pt: com ou sem sinal
ro: cu sau fără semn
th: มีหรือไม่มีเครื่องหมาย
tr: işaretli veya işaretsiz
uk: зі знаком або без знака
vi: có dấu hoặc không dấu
zh_hans: 有符号或无符号
zh_hant: 帶或不帶正負號

# Find_RangePreview
source: Range: {0} to {1} ({2}, {3})
ar: النطاق: {0} إلى {1} ({2}، {3})
cs: Rozsah: {0} až {1} ({2}, {3})
de: Bereich: {0} bis {1} ({2}, {3})
el: Εύρος: {0} έως {1} ({2}, {3})
es: Rango: de {0} a {1} ({2}, {3})
fa: محدوده: {0} تا {1} ({2}، {3})
fr: Plage : {0} à {1} ({2}, {3})
hu: Tartomány: {0} – {1} ({2}, {3})
id: Rentang: {0} hingga {1} ({2}, {3})
it: Intervallo: da {0} a {1} ({2}, {3})
ja: 範囲: {0}〜{1} ({2}, {3})
ko: 범위: {0}~{1}({2}, {3})
pl: Zakres: od {0} do {1} ({2}, {3})
pt: Intervalo: de {0} a {1} ({2}, {3})
ro: Interval: de la {0} la {1} ({2}, {3})
th: ช่วง: {0} ถึง {1} ({2}, {3})
tr: Aralık: {0} ile {1} ({2}, {3})
uk: Діапазон: від {0} до {1} ({2}, {3})
vi: Phạm vi: {0} đến {1} ({2}, {3})
zh_hans: 范围：{0} 到 {1}（{2}，{3}）
zh_hant: 範圍：{0} 到 {1}（{2}，{3}）

# Find_RangePreviewExclude
source: Outside the range: {0} to {1} ({2}, {3})
ar: خارج النطاق: {0} إلى {1} ({2}، {3})
cs: Mimo rozsah: {0} až {1} ({2}, {3})
de: Außerhalb des Bereichs: {0} bis {1} ({2}, {3})
el: Εκτός εύρους: {0} έως {1} ({2}, {3})
es: Fuera del rango: de {0} a {1} ({2}, {3})
fa: خارج از محدوده: {0} تا {1} ({2}، {3})
fr: Hors de la plage : {0} à {1} ({2}, {3})
hu: A tartományon kívül: {0} – {1} ({2}, {3})
id: Di luar rentang: {0} hingga {1} ({2}, {3})
it: Fuori dall'intervallo: da {0} a {1} ({2}, {3})
ja: 範囲外: {0}〜{1} ({2}, {3})
ko: 범위 밖: {0}~{1}({2}, {3})
pl: Poza zakresem: od {0} do {1} ({2}, {3})
pt: Fora do intervalo: de {0} a {1} ({2}, {3})
ro: În afara intervalului: de la {0} la {1} ({2}, {3})
th: นอกช่วง: {0} ถึง {1} ({2}, {3})
tr: Aralık dışı: {0} ile {1} ({2}, {3})
uk: Поза діапазоном: від {0} до {1} ({2}, {3})
vi: Ngoài phạm vi: {0} đến {1} ({2}, {3})
zh_hans: 范围之外：{0} 到 {1}（{2}，{3}）
zh_hant: 範圍外：{0} 到 {1}（{2}，{3}）

# Find_RegexBacktracking
source: Uses backtracking (lookaround or backreference), with a time limit per chunk.
ar: يستخدم التراجع (lookaround أو مرجعًا خلفيًا)، مع حد زمني لكل جزء.
cs: Používá zpětné vyhledávání (lookaround nebo zpětný odkaz) s časovým limitem pro každý blok.
de: Verwendet Backtracking (Lookaround oder Rückverweis) mit einem Zeitlimit pro Block.
el: Χρησιμοποιεί οπισθοδρόμηση (lookaround ή αναφορά προς τα πίσω), με χρονικό όριο ανά τμήμα.
es: Usa retroceso (búsqueda alrededor o referencia inversa), con un límite de tiempo por bloque.
fa: از عقب‌گرد (lookaround یا ارجاع به عقب) با محدودیت زمانی برای هر قطعه استفاده می‌کند.
fr: Utilise le retour arrière (assertion ou référence arrière), avec une limite de temps par bloc.
hu: Visszalépést használ (előre-/hátratekintés vagy visszahivatkozás), blokkonkénti időkorláttal.
id: Menggunakan backtracking (lookaround atau backreference), dengan batas waktu per potongan.
it: Usa il backtracking (lookaround o riferimento all'indietro), con un limite di tempo per blocco.
ja: 後方参照・先読み・後読みを使うため、チャンクごとの時間の上限付きで照合します。
ko: 역추적(전후방 탐색 또는 역참조)을 사용하며, 청크당 시간 제한이 있습니다.
pl: Używa nawracania (lookaround lub odwołania wstecznego) z limitem czasu na fragment.
pt: Usa backtracking (lookaround ou referência anterior), com um limite de tempo por bloco.
ro: Utilizează backtracking (lookaround sau referințe înapoi), cu o limită de timp pe fragment.
th: ใช้การย้อนรอย (lookaround หรือ backreference) โดยจำกัดเวลาต่อชิ้นข้อมูล
tr: Geri izleme kullanır (çevreye bakma veya geri başvuru); parça başına süre sınırı vardır.
uk: Використовується повернення (перегляд уперед/назад або зворотне посилання) з обмеженням часу на блок.
vi: Dùng quay lui (lookaround hoặc tham chiếu ngược), có giới hạn thời gian cho mỗi khối.
zh_hans: 使用回溯（环视或反向引用），每个块有时间限制。
zh_hant: 使用回溯（環顧或反向參考），每個區塊有時間限制。

# Find_RegexIgnoreCase.Content
source: i (ignore case)
ar: i (تجاهل حالة الأحرف)
cs: i (nerozlišovat velikost písmen)
de: i (Groß-/Kleinschreibung ignorieren)
el: i (χωρίς διάκριση πεζών-κεφαλαίων)
es: i (no distinguir mayúsculas y minúsculas)
fa: i (نادیده گرفتن بزرگی و کوچکی حروف)
fr: i (ignorer la casse)
hu: i (kis- és nagybetűk egyenértékűek)
id: i (abaikan huruf besar/kecil)
it: i (ignora maiuscole/minuscole)
ja: i (大文字・小文字を区別しない)
ko: i(대/소문자 무시)
pl: i (ignoruj wielkość liter)
pt: i (ignorar maiúsculas/minúsculas)
ro: i (ignorare majuscule/minuscule)
th: i (ไม่สนใจตัวพิมพ์ใหญ่-เล็ก)
tr: i (büyük/küçük harf yoksay)
uk: i (без урахування регістру)
vi: i (không phân biệt hoa/thường)
zh_hans: i（忽略大小写）
zh_hant: i（忽略大小寫）

# Find_RegexMultiline.Content
source: m (^ $ at line breaks)
ar: m (^ $ عند فواصل الأسطر)
cs: m (^ $ u konců řádků)
de: m (^ $ an Zeilenumbrüchen)
el: m (^ $ στις αλλαγές γραμμής)
es: m (^ $ en saltos de línea)
fa: m (^ $ در شکست خط‌ها)
fr: m (^ $ aux sauts de ligne)
hu: m (^ $ a sortöréseknél)
id: m (^ $ di pemisah baris)
it: m (^ $ alle interruzioni di riga)
ja: m (^ $ を行頭・行末に)
ko: m(줄 바꿈에서 ^ $)
pl: m (^ $ przy podziałach wierszy)
pt: m (^ $ nas quebras de linha)
ro: m (^ $ la sfârșituri de linie)
th: m (^ $ ที่การขึ้นบรรทัดใหม่)
tr: m (satır sonlarında ^ $)
uk: m (^ $ на розривах рядків)
vi: m (^ $ tại ngắt dòng)
zh_hans: m（^ $ 匹配换行处）
zh_hant: m（^ $ 符合換行處）

# Find_RegexSingleline.Content
source: s (. matches line breaks)
ar: s (. يطابق فواصل الأسطر)
cs: s (. odpovídá koncům řádků)
de: s (. passt auf Zeilenumbrüche)
el: s (το . αντιστοιχεί σε αλλαγές γραμμής)
es: s (. coincide con saltos de línea)
fa: s (. با شکست خط مطابقت دارد)
fr: s (. correspond aux sauts de ligne)
hu: s (a . a sortörésekre is illeszkedik)
id: s (. cocok dengan pemisah baris)
it: s (. corrisponde alle interruzioni di riga)
ja: s (. を改行に一致)
ko: s(.가 줄 바꿈과 일치)
pl: s (. dopasowuje podziały wierszy)
pt: s (. corresponde a quebras de linha)
ro: s (. corespunde sfârșiturilor de linie)
th: s (. ตรงกับการขึ้นบรรทัดใหม่)
tr: s (. satır sonlarıyla eşleşir)
uk: s (. відповідає розривам рядків)
vi: s (. khớp ngắt dòng)
zh_hans: s（. 匹配换行符）
zh_hant: s（. 符合換行）

# Find_RegexNote
source: Maximum match length: {0} bytes. Longer matches are not found.
ar: الحد الأقصى لطول التطابق: {0} بايت. لا يتم العثور على التطابقات الأطول.
cs: Maximální délka shody: {0} B. Delší shody se nenajdou.
de: Maximale Trefferlänge: {0} Bytes. Längere Treffer werden nicht gefunden.
el: Μέγιστο μήκος αντιστοιχίας: {0} byte. Μεγαλύτερες αντιστοιχίες δεν βρίσκονται.
es: Longitud máxima de coincidencia: {0} bytes. No se encuentran coincidencias más largas.
fa: حداکثر طول تطابق: {0} بایت. تطابق‌های طولانی‌تر یافت نمی‌شوند.
fr: Longueur maximale d'une correspondance : {0} octets. Les correspondances plus longues ne sont pas trouvées.
hu: Találat maximális hossza: {0} bájt. A hosszabb találatok nem lesznek megtalálva.
id: Panjang kecocokan maksimum: {0} byte. Kecocokan yang lebih panjang tidak ditemukan.
it: Lunghezza massima della corrispondenza: {0} byte. Le corrispondenze più lunghe non vengono trovate.
ja: 一致の最大長: {0} バイト。これより長い一致は見つかりません。
ko: 최대 일치 길이: {0}바이트. 이보다 긴 일치는 찾지 않습니다.
pl: Maksymalna długość dopasowania: {0} B. Dłuższe dopasowania nie są znajdowane.
pt: Comprimento máximo da correspondência: {0} bytes. Correspondências mais longas não são encontradas.
ro: Lungime maximă a potrivirii: {0} octeți. Potrivirile mai lungi nu sunt găsite.
th: ความยาวที่ตรงกันสูงสุด: {0} ไบต์ จะไม่พบรายการที่ตรงกันซึ่งยาวกว่านี้
tr: En uzun eşleşme uzunluğu: {0} bayt. Daha uzun eşleşmeler bulunmaz.
uk: Максимальна довжина збігу: {0} байтів. Довші збіги не знаходяться.
vi: Độ dài khớp tối đa: {0} byte. Không tìm được kết quả khớp dài hơn.
zh_hans: 最大匹配长度：{0} 字节。找不到更长的匹配项。
zh_hant: 最大符合長度：{0} 個位元組。找不到更長的符合項目。

# Find_RegexSettings.Content
source: Change
ar: تغيير
cs: Změnit
de: Ändern
el: Αλλαγή
es: Cambiar
fa: تغییر
fr: Modifier
hu: Módosítás
id: Ubah
it: Cambia
ja: 変更
ko: 변경
pl: Zmień
pt: Alterar
ro: Modificare
th: เปลี่ยน
tr: Değiştir
uk: Змінити
vi: Thay đổi
zh_hans: 更改
zh_hant: 變更

# Find_RegexMode_Linear
source: Regular expression (linear time)
ar: تعبير عادي (وقت خطي)
cs: Regulární výraz (lineární čas)
de: Regulärer Ausdruck (lineare Zeit)
el: Κανονική έκφραση (γραμμικός χρόνος)
es: Expresión regular (tiempo lineal)
fa: عبارت باقاعده (زمان خطی)
fr: Expression régulière (temps linéaire)
hu: Reguláris kifejezés (lineáris idejű)
id: Ekspresi reguler (waktu linear)
it: Espressione regolare (tempo lineare)
ja: 正規表現 (後戻りしない方式)
ko: 정규식(선형 시간)
pl: Wyrażenie regularne (czas liniowy)
pt: Expressão regular (tempo linear)
ro: Expresie regulată (timp liniar)
th: นิพจน์ทั่วไป (เวลาเชิงเส้น)
tr: Normal ifade (doğrusal süre)
uk: Регулярний вираз (лінійний час)
vi: Biểu thức chính quy (thời gian tuyến tính)
zh_hans: 正则表达式（线性时间）
zh_hant: 規則運算式（線性時間）

# Find_RegexMode_Backtracking
source: Regular expression (backtracking, with a time limit)
ar: تعبير عادي (تراجع، مع حد زمني)
cs: Regulární výraz (zpětné vyhledávání, s časovým limitem)
de: Regulärer Ausdruck (Backtracking, mit Zeitlimit)
el: Κανονική έκφραση (οπισθοδρόμηση, με χρονικό όριο)
es: Expresión regular (retroceso, con límite de tiempo)
fa: عبارت باقاعده (عقب‌گرد، با محدودیت زمانی)
fr: Expression régulière (retour arrière, avec limite de temps)
hu: Reguláris kifejezés (visszalépéses, időkorláttal)
id: Ekspresi reguler (backtracking, dengan batas waktu)
it: Espressione regolare (backtracking, con limite di tempo)
ja: 正規表現 (後戻りする方式、時間の上限付き)
ko: 정규식(역추적, 시간 제한 있음)
pl: Wyrażenie regularne (nawracanie, z limitem czasu)
pt: Expressão regular (backtracking, com limite de tempo)
ro: Expresie regulată (backtracking, cu limită de timp)
th: นิพจน์ทั่วไป (ย้อนรอย พร้อมจำกัดเวลา)
tr: Normal ifade (geri izleme, süre sınırlı)
uk: Регулярний вираз (з поверненням, з обмеженням часу)
vi: Biểu thức chính quy (quay lui, có giới hạn thời gian)
zh_hans: 正则表达式（回溯，有时间限制）
zh_hant: 規則運算式（回溯，有時間限制）

# Find_RegexTimedOut
source: Stopped: the regular expression reached the time limit.
ar: تم الإيقاف: وصل التعبير العادي إلى الحد الزمني.
cs: Zastaveno: regulární výraz dosáhl časového limitu.
de: Abgebrochen: Der reguläre Ausdruck hat das Zeitlimit erreicht.
el: Διακόπηκε: η κανονική έκφραση έφτασε στο χρονικό όριο.
es: Detenido: la expresión regular alcanzó el límite de tiempo.
fa: متوقف شد: عبارت باقاعده به محدودیت زمانی رسید.
fr: Arrêté : l'expression régulière a atteint la limite de temps.
hu: Leállítva: a reguláris kifejezés elérte az időkorlátot.
id: Dihentikan: ekspresi reguler mencapai batas waktu.
it: Interrotta: l'espressione regolare ha raggiunto il limite di tempo.
ja: 正規表現の時間の上限に達したため中止しました。
ko: 중지됨: 정규식이 시간 제한에 도달했습니다.
pl: Zatrzymano: wyrażenie regularne osiągnęło limit czasu.
pt: Interrompida: a expressão regular atingiu o limite de tempo.
ro: Oprit: expresia regulată a atins limita de timp.
th: หยุดแล้ว: นิพจน์ทั่วไปถึงขีดจำกัดเวลา
tr: Durduruldu: normal ifade süre sınırına ulaştı.
uk: Зупинено: регулярний вираз досяг обмеження часу.
vi: Đã dừng: biểu thức chính quy đạt giới hạn thời gian.
zh_hans: 已停止：正则表达式达到时间限制。
zh_hant: 已停止：規則運算式已達到時間限制。

# Find_RegexTimeout_Ask
source: The regular expression took too long on {1} bytes at {0}. Skip this part and continue?
ar: استغرق التعبير العادي وقتًا طويلاً على {1} بايت عند {0}. هل تريد تخطي هذا الجزء والمتابعة؟
cs: Regulární výraz trval příliš dlouho u {1} B na pozici {0}. Přeskočit tuto část a pokračovat?
de: Der reguläre Ausdruck hat bei {1} Bytes an {0} zu lange gedauert. Diesen Teil überspringen und fortfahren?
el: Η κανονική έκφραση χρειάστηκε πολύ χρόνο για {1} byte στο {0}. Παράλειψη αυτού του τμήματος και συνέχεια;
es: La expresión regular tardó demasiado en {1} bytes en {0}. ¿Omitir esta parte y continuar?
fa: عبارت باقاعده روی {1} بایت در {0} بیش از حد طول کشید. از این بخش رد شود و ادامه یابد؟
fr: L'expression régulière a pris trop de temps sur {1} octets à {0}. Ignorer cette partie et continuer ?
hu: A reguláris kifejezés túl sokáig futott a(z) {0} helyen kezdődő {1} bájton. Kihagyja ezt a részt, és folytatja?
id: Ekspresi reguler memakan waktu terlalu lama pada {1} byte di {0}. Lewati bagian ini dan lanjutkan?
it: L'espressione regolare ha impiegato troppo tempo su {1} byte a {0}. Saltare questa parte e continuare?
ja: {0} からの {1} バイトの照合が時間の上限に達しました。この部分を飛ばして続けますか?
ko: {0} 위치의 {1}바이트에서 정규식 처리 시간이 너무 오래 걸렸습니다. 이 부분을 건너뛰고 계속하시겠습니까?
pl: Wyrażenie regularne działało zbyt długo na {1} B w miejscu {0}. Pominąć tę część i kontynuować?
pt: A expressão regular demorou demais em {1} bytes em {0}. Ignorar esta parte e continuar?
ro: Expresia regulată a durat prea mult pe {1} octeți la {0}. Omiteți această parte și continuați?
th: นิพจน์ทั่วไปใช้เวลานานเกินไปกับ {1} ไบต์ที่ {0} ข้ามส่วนนี้และดำเนินการต่อหรือไม่
tr: Normal ifade {0} konumundaki {1} baytta çok uzun sürdü. Bu kısım atlanıp devam edilsin mi?
uk: Регулярний вираз занадто довго обробляв {1} байтів у позиції {0}. Пропустити цю частину й продовжити?
vi: Biểu thức chính quy mất quá nhiều thời gian với {1} byte tại {0}. Bỏ qua phần này và tiếp tục?
zh_hans: 正则表达式在 {0} 处的 {1} 字节上耗时过长。是否跳过此部分并继续？
zh_hant: 規則運算式在 {0} 處的 {1} 個位元組上花費太久。要略過此部分並繼續嗎？
